In [2]:
#dealing with missing values
import pandas as pd
import numpy as np

In [3]:
#replacing missing values
# with constant number
# with mean
# with median
# with forward fill(good for time series)
# with backward fill (good for time series)
# interpolation method
#       #polynomial
#       #pad

# 6. drop any duplicate columns
# 7. drop columns having constant values
# 8. cleaning scrapped data

In [9]:
dum_df = pd.DataFrame({'name': ['Mukesh', 'Akash', 'Ohm'],
                       'age': [21, 22, 23],
                       'smokes': ['NO', np.nan, np.nan]})

In [11]:
dum_df

     name  age smokes
0  Mukesh   21     NO
1   Akash   22    NaN
2     Ohm   23    NaN

In [13]:
dum_df.isnull().sum()

name      0
age       0
smokes    2
dtype: int64

In [16]:
dum_df_new = dum_df.dropna()
dum_df_new

     name  age smokes
0  Mukesh   21     NO

In [18]:
#if column have more than 60-70% miss data, remove it

In [30]:
dum_df = pd.DataFrame({'name': ['Mukesh', 'Akash', 'Ohm'],
                       'age': [21, 22, 23],
                       'smokes': ['NO', np.nan, np.nan]})

In [31]:
dum_df

     name  age smokes
0  Mukesh   21     NO
1   Akash   22    NaN
2     Ohm   23    NaN

In [32]:
dum_df.drop(['smokes'],axis = 1 , inplace = True)
dum_df

     name  age
0  Mukesh   21
1   Akash   22
2     Ohm   23

In [37]:
dum_df.columns = ['name','ages']
dum_df

     name  ages
0  Mukesh    21
1   Akash    22
2     Ohm    23

In [38]:
#copy type
#1. deep copy
#2. shallow copy

In [45]:
import copy

list_1 = [3,4,[5],6,7]
list_2 = copy.deepcopy(list_1)
list_2[2][0] = 2

list_1
list_2

[3, 4, [2], 6, 7]

In [52]:
dum_df = pd.DataFrame({'name': ['Mukesh', 'Akash', 'Ohm','manu','rahul','vikas'],
                       'age': [21, 22, 23, 43,27,30],
                       'smokes': ['NO', np.nan, np.nan, 'Yes',np.nan, 'Yes'],
                      'Tar level': [20,np.nan,50,np.nan,20,60]})

dum_df

     name  age smokes  Tar level
0  Mukesh   21     NO       20.0
1   Akash   22    NaN        NaN
2     Ohm   23    NaN       50.0
3    manu   43    Yes        NaN
4   rahul   27    NaN       20.0
5   vikas   30    Yes       60.0

In [54]:
dum_df_1 = dum_df.copy(deep = True) 
dum_df_1

     name  age smokes  Tar level
0  Mukesh   21     NO       20.0
1   Akash   22    NaN        NaN
2     Ohm   23    NaN       50.0
3    manu   43    Yes        NaN
4   rahul   27    NaN       20.0
5   vikas   30    Yes       60.0

In [56]:
dum_df_1.isnull().sum()

name         0
age          0
smokes       3
Tar level    2
dtype: int64

In [58]:
dum_df_1_c = dum_df_1.fillna('NO')
dum_df_1_c

     name  age smokes Tar level
0  Mukesh   21     NO      20.0
1   Akash   22     NO        NO
2     Ohm   23     NO      50.0
3    manu   43    Yes        NO
4   rahul   27     NO      20.0
5   vikas   30    Yes      60.0

In [62]:
dum_df_1_mean = dum_df_1.fillna(dum_df_1.mean())
dum_df_1_mean

C:\Users\Arun\AppData\Local\Temp\ipykernel_162904\1003379987.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  dum_df_1_mean = dum_df_1.fillna(dum_df_1.mean())

     name  age smokes  Tar level
0  Mukesh   21     NO       20.0
1   Akash   22    NaN       37.5
2     Ohm   23    NaN       50.0
3    manu   43    Yes       37.5
4   rahul   27    NaN       20.0
5   vikas   30    Yes       60.0

In [65]:
dum_df_1_mean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   name       6 non-null      object
 1   age        6 non-null      int64
 2   smokes     3 non-null      object
 3   Tar level  6 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 320.0+ bytes